app/controllers/home_controller.rb

  def bloglists
    @allblogs = Blog.all
---
SELECT `blogs`.* FROM `blogs`

  def createblog
    Blog.create(:title=>params[:one_blog][:title],:blog_body=>params[:one_blog][:blog_body],:author_type=>params[:one_blog][:author_type])
---
INSERT INTO `blogs` (`title`, `author_type`, `blog_body`, `created_at`, `updated_at`) VALUES ('new test data 3', 'Guest', 'new test data 33', '2022-05-14 08:15:46', '2022-05-14 08:15:46')

  def editblog
    @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1

  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 4 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 4

  def update
    @blog = Blog.find(params[:id])
    @blog.update(:title=>params[:blog][:title],:blog_body=>params[:blog][:blog_body],:author_type=>params[:blog][:author_type])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 10 LIMIT 1
UPDATE `blogs` SET `title` = 'new test data 1 1', `blog_body` = 'new test data 111', `author_type` = 'User', `updated_at` = '2022-05-15 04:55:45' WHERE `blogs`.`id` = 8